Tekla Open API Reference for Tekla Structures 2025
WeldSeamPositionEnum Enumeration
 Weld seam position types.
 Namespace: Tekla.Structures.Model.Welding
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WeldSeamPositionEnum
Public Enumeration WeldSeamPositionEnum
Members
Member name | Value | Description
SEAM_ABOVE | 1 |  Seam above.
SEAM_BELOW | 2 |  Seam below.
See Also
Reference
Tekla.Structures.Model.Welding Namespace